# NotifyPullDownClicked

## Description
Sends an item hit notification when the pull down menu is clicked, allowing developers to dynamically populate the menu.

```pascal
PROCEDURE NotifyPullDownClicked(
				nDialogID    : LONGINT;
				nComponentID : LONGINT);
```

```python
def vs.NotifyPullDownClicked(nDialogID, nComponentID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|nDialogID|LONGINT|   |
|nComponentID|LONGINT|   |

## Version
Availability: from VectorWorks13.0

## Category
* Dialogs - Modern